# 1. SF Salaries Exercise 

In this exercise, we will be using the [SF Salaries Dataset](https://www.kaggle.com/kaggle/sf-salaries) from Kaggle.

Follow along and complete the tasks outlined in bold below. 

First execute the following shell command to download the data file onto the virtual disk of your colab session:

In [1]:
!curl -L -s -o Salaries.csv "https://raw.githubusercontent.com/justinjiajia/datafiles/main/Salaries.csv"

In [ ]:
!ls   # running ls returns a list of files on your virtual disk; Salaries.csv should be found in the output list

**Import pandas as pd.**

**Read Salaries.csv as a dataframe called `sal`.**

**Check the head of the DataFrame.**

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

**Use the `info()` method to find out how many entries there are.**

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
Id                  148654 non-null int64
EmployeeName        148654 non-null object
JobTitle            148654 non-null object
BasePay             148045 non-null float64
OvertimePay         148650 non-null float64
OtherPay            148650 non-null float64
Benefits            112491 non-null float64
TotalPay            148654 non-null float64
TotalPayBenefits    148654 non-null float64
Year                148654 non-null int64
Notes               0 non-null float64
Agency              148654 non-null object
Status              0 non-null float64
dtypes: float64(8), int64(2), object(3)
memory usage: 14.7+ MB

**What is the average `BasePay`?**

66325.44884050643

**What is the highest amount of `OvertimePay` in the dataset?**

245131.88

**What is the job title of `JOSEPH DRISCOLL`? Note: Use all caps, otherwise you may get an answer that doesn't match up (there is also a lowercase `Joseph Driscoll`).**

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

**How much does `JOSEPH DRISCOLL` make (including benefits)?**

24    270324.91
Name: TotalPayBenefits, dtype: float64

**What is the name of highest paid person (including benefits)?**

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN

**What is the name of lowest paid person (including benefits)? Do you notice something strange about how much he or she is paid?**

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.0,0.0,-618.13,0.0,-618.13,-618.13,2014,NaN,San Francisco,NaN

**What was the average (mean) `BasePay` of all employees per year? (2011-2014) ?**

Year
2011    63595.956517
2012    65436.406857
2013    69630.030216
2014    66564.421924
Name: BasePay, dtype: float64

**How many unique job titles are there?**

2159

**What are the top 5 most common jobs?**

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: JobTitle, dtype: int64

**How many Job Titles were represented by only one person in 2013? (e.g. Job Titles with only one occurence in 2013?)**

202

**How many people have the word Chief in their job title? (This is pretty tricky)**

477

**Is there a correlation between length of the Job Title string and Salary?**

                  title_len  TotalPayBenefits
title_len          1.000000         -0.036878
TotalPayBenefits  -0.036878          1.000000

 
# 2. Ecommerce Purchases Exercise

In this Exercise you will be given some Fake Data about some purchases done through Amazon. Please excuse anything that doesn't make "Real-World" sense in the dataframe, all the data is fake and made-up.

Most of the tasks can be solved in different ways. Also note that all of these questions can be answered with one line of code.


First execute the following shell command to download the data file onto the virtual disk of your colab session:

In [1]:
!curl -L -s -o ecommerce.csv "https://raw.githubusercontent.com/justinjiajia/datafiles/main/EcommercePurchases.csv"

In [ ]:
!ls   # running ls returns a list of files on your virtual disk; ecommerce.csv should be found in the output list

 
____

**Read in the ecommerce csv file and set it to a DataFrame called `ecom`.**

**Check the head of the DataFrame.**

                                             Address  ... Purchase Price
0  16629 Pace Camp Apt. 448\nAlexisborough, NE 77...  ...          98.14
1  9374 Jasmine Spurs Suite 508\nSouth John, TN 8...  ...          70.73
2                   Unit 0065 Box 5052\nDPO AP 27450  ...           0.95
3              7780 Julia Fords\nNew Stacy, WA 45798  ...          78.04
4  23012 Munoz Drive Suite 337\nNew Cynthia, TX 5...  ...          77.82

[5 rows x 14 columns]

**How many rows and columns are there?**

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 14 columns):
Address             10000 non-null object
Lot                 10000 non-null object
AM or PM            10000 non-null object
Browser Info        10000 non-null object
Company             10000 non-null object
Credit Card         10000 non-null int64
CC Exp Date         10000 non-null object
CC Security Code    10000 non-null int64
CC Provider         10000 non-null object
Email               10000 non-null object
Job                 10000 non-null object
IP Address          10000 non-null object
Language            10000 non-null object
Purchase Price      10000 non-null float64
dtypes: float64(1), int64(2), object(11)
memory usage: 1.1+ MB

**What is the average Purchase Price?**

50.34730200000025

**What were the highest and lowest purchase prices?**

99.99

0.0

**How many people have English 'en' as their Language of choice on the website?**

Address             1098
Lot                 1098
AM or PM            1098
Browser Info        1098
Company             1098
Credit Card         1098
CC Exp Date         1098
CC Security Code    1098
CC Provider         1098
Email               1098
Job                 1098
IP Address          1098
Language            1098
Purchase Price      1098
dtype: int64

**How many people have the job title of "Lawyer"?**

<class 'pandas.core.frame.DataFrame'>
Int64Index: 30 entries, 470 to 9979
Data columns (total 14 columns):
Address             30 non-null object
Lot                 30 non-null object
AM or PM            30 non-null object
Browser Info        30 non-null object
Company             30 non-null object
Credit Card         30 non-null int64
CC Exp Date         30 non-null object
CC Security Code    30 non-null int64
CC Provider         30 non-null object
Email               30 non-null object
Job                 30 non-null object
IP Address          30 non-null object
Language            30 non-null object
Purchase Price      30 non-null float64
dtypes: float64(1), int64(2), object(11)
memory usage: 3.5+ KB

**How many people made the purchase during the AM and how many people made the purchase during PM?**

**(Hint: check out [`value_counts()`](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.value_counts.html) )**

PM    5068
AM    4932
Name: AM or PM, dtype: int64

**What are the 5 most common Job Titles?**

Interior and spatial designer        31
Lawyer                               30
Social researcher                    28
Research officer, political party    27
Designer, jewellery                  27
Name: Job, dtype: int64

**Someone made a purchase that came from Lot: "90 WT" , what was the Purchase Price for this transaction?**

513    75.1
Name: Purchase Price, dtype: float64

**What is the email of the person with the following Credit Card Number: 4926535242672853**

1234    bondellen@williams-garza.com
Name: Email, dtype: object

**How many people have American Express as their Credit Card Provider and made a purchase above $95 ?**

Address             39
Lot                 39
AM or PM            39
Browser Info        39
Company             39
Credit Card         39
CC Exp Date         39
CC Security Code    39
CC Provider         39
Email               39
Job                 39
IP Address          39
Language            39
Purchase Price      39
dtype: int64

**How many people have a credit card that expires in 2025?**

1033

**What are the top 5 most popular email providers/hosts (e.g. gmail.com, yahoo.com, etc...)**

hotmail.com     1638
yahoo.com       1616
gmail.com       1605
smith.com         42
williams.com      37
Name: Email, dtype: int64

# 3. World alcohol consumption Exercise

We are going to analyze a set of national data of 192 countries on average alcohol consumption per capita in standard serving size in 2010. The data also describes consumption by beverage type: wine, beer, spirits and "other". In other words, the data shows how many glasses of wine, cans of beer and shots of spirits were drunk per person in each of 192 countries in 2010.



Follow along and complete the tasks outlined in bold below.

First execute the following shell command to download the data file onto the virtual disk of your colab session:

In [ ]:
!curl -L -s -o drinks.csv "https://raw.githubusercontent.com/justinjiajia/datafiles/main/drinks.csv"

**Read drinks.csv as a dataframe called `drinks`.**

**Check the head of the DataFrame.**

         country  beer_servings  ...  total_litres_of_pure_alcohol      continent
0    Afghanistan              0  ...                           0.0           Asia
1        Albania             89  ...                           4.9         Europe
2        Algeria             25  ...                           0.7         Africa
3        Andorra            245  ...                          12.4         Europe
4         Angola            217  ...                           5.9         Africa
..           ...            ...  ...                           ...            ...
188    Venezuela            333  ...                           7.7  South America
189      Vietnam            111  ...                           2.0           Asia
190        Yemen              6  ...                           0.1           Asia
191       Zambia             32  ...                           2.5         Africa
192     Zimbabwe             64  ...                           4.7         Africa

[193 rows x 6 columns]

**What is the average of beer serving across all countries?**

106.16062176165804

**What is the average beer serving in
Africa?**

61.471698113207545

**What is the average consumption of beer
by continent?**

continent
Africa            61.471698
Asia              37.045455
Europe           193.777778
North America    145.434783
Oceania           89.687500
South America    175.083333
Name: beer_servings, dtype: float64

**What are the min, max, and count values
of ALL continents?**

                     mean  min  max  count
continent
Africa          61.471698    0  376     53
Asia            37.045455    0  247     44
Europe         193.777778    0  361     45
North America  145.434783    1  285     23
Oceania         89.687500    0  306     16
South America  175.083333   93  333     12

**What are the mean values for (a) beer
servings, (b) spirit servings, (c) wine servings, and
(d) total litres of pure alcohol for ALL continents?**

               beer_servings  ...  total_litres_of_pure_alcohol
continent                     ...
Africa             61.471698  ...                      3.007547
Asia               37.045455  ...                      2.170455
Europe            193.777778  ...                      8.617778
North America     145.434783  ...                      5.995652
Oceania            89.687500  ...                      3.381250
South America     175.083333  ...                      6.308333

[6 rows x 4 columns]

**Find the top 5 countries that drink the most of each drink**

                                             country  ... consumption
type                                                  ...
beer_servings                117             Namibia  ...       376.0
                             45       Czech Republic  ...       361.0
                             62                Gabon  ...       347.0
                             65              Germany  ...       346.0
                             98            Lithuania  ...       343.0
spirit_servings              261             Grenada  ...       438.0
                             208             Belarus  ...       373.0
                             266               Haiti  ...       326.0
                             334  Russian Federation  ...       326.0
                             337           St. Lucia  ...       315.0
total_litres_of_pure_alcohol 594             Belarus  ...        14.4
                             677           Lithuania  ...        12.9
                             582             Andorra  ...        12.4
                             647             Grenada  ...        11.9
                             624      Czech Republic  ...        11.8
wine_servings                447              France  ...       370.0
                             522            Portugal  ...       339.0
                             389             Andorra  ...       312.0
                             552         Switzerland  ...       280.0
                             434             Denmark  ...       278.0

[20 rows x 4 columns]